WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
        if (config->default_cell_settings != NULL && 
            settings->settings->apn != NULL && 
            strlen(settings->settings->apn) <= MAXIMUM_APN_LENGTH && 
            strlen(settings->settings->apn) > 0 &&
            settings->settings->operator != NULL && 
            strlen(settings->settings->operator) <= MAXIMUM_OPERATOR_LENGTH && 
            strlen(settings->settings->operator) > 0) 
        {
            config->default_cell_settings->apn = kmm_strdup(settings->settings->apn);
            syslog(LOG_INFO, "Default cell APN loaded: %s\n", config->default_cell_settings->apn);

            config->default_cell_settings->operator = kmm_strdup(settings->settings->operator);
            syslog(LOG_INFO, "Default cell operator loaded: %s\n", config->default_cell_settings->operator);

            config->default_cell_settings->timeout = (settings->settings->timeout != NULL && 
                                                    strlen(settings->settings->timeout) <= MAXIMUM_TIMEOUT_LENGTH && 
                                                    strlen(settings->settings->timeout) > 0) ? 
                                                    kmm_strdup(settings->settings->timeout) : 
                                                    kmm_strdup(DEFAULT_CELL_PPPD_TIMEOUT);

            syslog(LOG_INFO, "Default cell PPPD timeout loaded: %s\n", config->default_cell_settings->timeout);

            config->default_cell_settings->pap_user = (settings->settings->user != NULL && 
                                                        strlen(settings->settings->user) <= MAXIMUM_USER_LENGTH && 
                                                        strlen(settings->settings->user) > 0) ? 
                                                        kmm_strdup(settings->settings->user) : 
                                                        kmm_strdup(DEFAULT_CELL_PAP_USER);

            syslog(LOG_INFO, "Default cell PAP username loaded: %s\n", config->default_cell_settings->pap_user);

            config->default_cell_settings->pap_password = (settings->settings->password != NULL && 
                                                            strlen(settings->settings->password) <= MAXIMUM_PASSWORD_LENGTH && 
                                                            strlen(settings->settings->password) > 0) ? 
                                                            kmm_strdup(settings->settings->password) : 
                                                            kmm_strdup(DEFAULT_CELL_PAP_PASSWORD);

            syslog(LOG_INFO, "Default cell PAP password loaded: %s\n", config->default_cell_settings->pap_password);

            config->default_cell_settings->ttyname = (settings->settings->ttyname != NULL && 
                                                        strlen(settings->settings->ttyname) <= MAXIMUM_INTERFACE_LENGTH && 
                                                        strlen(settings->settings->ttyname) > 0) ? 
                                                        kmm_strdup(settings->settings->ttyname) : 
                                                        kmm_strdup(DEFAULT_CELL_INTERFACE);

            syslog(LOG_INFO, "Default cell interface name loaded: %s\n", config->default_cell_settings->ttyname);

            config->default_cell_settings->mode = (settings->settings->mode != NULL && 
                                                        strlen(settings->settings->mode) <= MAXIMUM_MODE_LENTGH && 
                                                        strlen(settings->settings->mode) > 0) ? 
                                                        kmm_strdup(settings->settings->mode) : 
                                                        kmm_strdup(DEFAULT_CELL_MODE);

            syslog(LOG_INFO, "Default cell operation mode loaded: %s\n", config->default_cell_settings->mode);
        }
        else 
        {
            if (config->default_cell_settings != NULL) 
            {
                free(config->default_cell_settings);
                config->default_cell_settings = NULL;
            }
            syslog(LOG_ERR, "Failed to get default cell settings\n");
        }

        hcom_nx_config_unlock();
        cyaml_free(&cyaml_config, &cell_settings_schema, settings, 0);
        syslog(LOG_INFO, "Cyaml free\n");
    }
    
    //  TODO: Delete file after reading in the case of a private APN
    
}

/****************************************************************************
 * Name: hcom_nx_config_set_time_to_os_build_time
 *
 * Description:
 *  Use the OS build time as the minimum initial value for the system clock.
 * 
 *  SSL certificate validation requires the clock to be set to a recent time.
 *  The board must be operating after the OS build time so using this gives
 *  the board a starting point.  A more accurate clock can be set later
 *  using NTP.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
void hcom_nx_config_set_time_to_os_build_time(void)
{
    struct timespec tp;
    clock_gettime(CLOCK_REALTIME, &tp);
    if (tp.tv_sec < HCOM_DEVICE_INFO_BUILD_EPOCH_TIME)
    {
        tp.tv_sec = HCOM_DEVICE_INFO_BUILD_EPOCH_TIME;
        tp.tv_nsec = 0;
        clock_settime(CLOCK_REALTIME, &tp);
    }
}

/****************************************************************************
 * Name: hcom_nx_turn_on_the_modem
 *
 * Description:
 *  Function to turn on the cell module, which can vary according to
 *  the meadow device pinout and modem model used.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  For now, it's only working for BG770A-GL cell wing used with 
 *  Meadow F7v2 Feather. But, further it can be used as a generic function
 *  to turn on other modules, according to the meadow device used.
 *
 ****************************************************************************/
void hcom_nx_turn_on_the_modem(void)
{
    // Low pulse for 3 seconds to turn on the Quectel BG770A-GL cell module
    stm32_configgpio(GPIO_OUTPUT | GPIO_FLOAT | GPIO_OPENDRAIN | F7_MICRO_V2_D10_PIN); 
    stm32_gpiowrite(F7_MICRO_V2_D10_PIN, false);
    usleep(3000000);
    stm32_gpiowrite(F7_MICRO_V2_D10_PIN, true);
    stm32_gpiowrite(F7_MICRO_V2_D10_PIN, false);

    // TODO: Add support to turn on the BG770A-GL on the Project Lab
}

/****************************************************************************
 * Name: hcom_nx_config_refresh_mono_version
 *
 * Description:
 *  Refresh the mono version in the specified configuration object.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration object must be locked before this method is called.
 *
 ****************************************************************************/
void hcom_nx_config_refresh_mono_version(meadow_configuration_t *config)
{
    uint32_t block_size = hcom_nx_exec_ex_flash_get_block_size();

    mono_signature_t *mono_signature = (mono_signature_t *) kmm_zalloc(block_size);
    if (mono_signature != NULL)
    {
        hcom_nx_exec_ex_flash_read_absolute_block(0, (void *) mono_signature);
        memset(&config->mono_version, 0, sizeof(meadow_version_number_t));
        if (mono_signature->signature != 0xDDCCBBAA)
        {
            syslog(LOG_ERR, "Mono runtime was not found flashed in external flash.\n");
        }
        else
        {
            if ((mono_signature->build & 0x00ffff00) != 0)
            {
                //
                //  For older versions of Meadow.OS.Runtime.bin the version number
                //  was encoded as a single uint32_t.
                //
                //  TODO: Change this after version 1.0 and before version 256.0.
                //
                config->mono_version.revision = (mono_signature->build >> 8) & 0xff;
                config->mono_version.minor = (mono_signature->build >> 16) & 0xff;
                config->mono_version.major = (mono_signature->build  >> 24) & 0xff;
                config->mono_version.build = mono_signature->build & 0xff;
            }
            else
            {
                config->mono_version.build = mono_signature->build;
                config->mono_version.revision = mono_signature->revision;
                config->mono_version.minor = mono_signature->minor;
                config->mono_version.major = mono_signature->major;
                config->mono_version.day = mono_signature->day;
                config->mono_version.month = mono_signature->month;
                hcom_nx_config_set_month_text(&config->mono_version);
                config->mono_version.year = mono_signature->year;
                config->mono_version.hour = mono_signature->hour;
                config->mono_version.minute = mono_signature->minute;
                config->mono_version.second = mono_signature->second;
                config->mono_version.hash = mono_signature->hash;
                config->mono_version.branch_name = kmm_strdup((char *) &mono_signature->start_of_branch_string);
                config->mono_version.short_string = hcom_nx_config_get_short_version_string(&config->mono_version);
                config->mono_version.long_string = hcom_nx_config_get_long_version_string(&config->mono_version);
            }
        }
        kmm_free(mono_signature);
    }
}

/****************************************************************************
 * Name: hcom_nx_config_init
 *
 * Description:
 *  Setup the configuration system and populate the configuration structure
 *  with data from the configuration file.
 * 
 *  Note that one of the side effects of this method is to copy the Mono
 *  runtime into RAM making it ready for use (assuming the runtime file is 
 *  validated OK).
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_init(void)
{
    if (meadow_configuration == NULL)
    {
        sem_init(&config_lock, 0, 1);                   // Create the config lock.
        sem_setprotocol(&config_lock, SEM_PRIO_NONE);
        hcom_nx_config_read_file();

        hcom_nx_config_lock();
        meadow_configuration_t *config = hcom_nx_config_get_pointer();
        hcom_nx_config_set_host_name(config, config->device_name);
        config->hardware_version = meadow_hw_version_get();
        hcom_nx_config_refresh_mono_version(config);
        config->os_version.major = HCOM_DEVICE_INFO_MAJOR;
        config->os_version.minor = HCOM_DEVICE_INFO_MINOR;
        config->os_version.revision = HCOM_DEVICE_INFO_REVISION;
        config->os_version.build = HCOM_DEVICE_INFO_BUILD;
        config->os_version.day = HCOM_DEVICE_INFO_BUILD_DAY;
        config->os_version.month = HCOM_DEVICE_INFO_BUILD_MONTH;
        hcom_nx_config_set_month_text(&config->os_version);
        config->os_version.year = HCOM_DEVICE_INFO_BUILD_YEAR;
        config->os_version.hour = HCOM_DEVICE_INFO_BUILD_HOUR;
        config->os_version.minute = HCOM_DEVICE_INFO_BUILD_MINUTE;
        config->os_version.second = HCOM_DEVICE_INFO_BUILD_SECOND;
        config->os_version.hash = HCOM_DEVICE_INFO_BUILD_HASH_NUMBER;
        config->os_version.branch_name = HCOM_DEVICE_INFO_GIT_REF;
        config->os_version.short_string = hcom_nx_config_get_short_version_string(&config->os_version);
        config->os_version.long_string = hcom_nx_config_get_long_version_string(&config->os_version);
        config->hardware_version_text = meadow_hw_version_string_return();
        stm32_get_uniqueid(config->serial_number);                           // Convert chip Id to serial number
        config->chip_id[0] = config->serial_number[11];                      // 95-88
        config->chip_id[1] = config->serial_number[10] + config->serial_number[2];        // 87-80 + 23-16
        config->chip_id[2] = config->serial_number[9];                       // 79-72
        config->chip_id[3] = config->serial_number[8] + config->serial_number[0] + 10;    // 71-64 + 7-0 + magic 10
        config->chip_id[4] = config->serial_number[7];                       // 63-56
        config->chip_id[5] = config->serial_number[6];                       // 55-48

        hcom_nx_config_unlock();
    }
    else
    {
        syslog(LOG_ERR, "Configuration should only be initialised once.\n");
    }
}
